from flask import Flask, render_template
import random
from collections import defaultdict

app = Flask(__name__)

classes = [f"{i}{l}" for i in range(5, 12) for l in ['А', 'Б']]

programme = {
    5: {
        'математика': 5, 'українська_мова': 4, 'українська_література': 2, 'англійська': 3, 'історія': 2,
        'природознавство': 2, 'фізкультура': 3, 'мистецтво': 2, 'трудове_навчання': 1, 'інформатика': 1
    },
    6: {
        'математика': 5, 'українська_мова': 3, 'українська_література': 2, 'англійська': 3, 'історія': 2,
        'природознавство': 2, 'фізкультура': 3, 'мистецтво': 1, 'трудове_навчання': 1, 'інформатика': 1
    },
    7: {
        'алгебра': 3, 'геометрія': 2, 'українська_мова': 2, 'українська_література': 2, 'англійська': 3, 'історія': 2,
        'біологія': 2, 'фізика': 2, 'географія': 1, 'фізкультура': 3,
        'мистецтво': 1, 'трудове_навчання': 1, 'інформатика': 1
    },
    8: {
        'алгебра': 3, 'геометрія': 2, 'українська_мова': 2, 'українська_література': 2, 'англійська': 3,
        'історія_України': 1, 'всесвітня_історія': 1, 'біологія': 2, 'фізика': 2,
        'хімія': 2, 'географія': 1, 'фізкультура': 3, 'трудове_навчання': 1, 'інформатика': 1
    },
    9: {
        'алгебра': 3, 'геометрія': 2, 'українська_мова': 2, 'українська_література': 2, 'англійська': 3,
        'історія_України': 1, 'всесвітня_історія': 1, 'біологія': 2, 'фізика': 2,
        'хімія': 2, 'географія': 1, 'основи_здоров’я': 1, 'фізкультура': 3,
        'трудове_навчання': 1, 'інформатика': 1
    },
    10: {
        'українська_мова': 2, 'українська_література': 2, 'англійська': 3, 'алгебра': 4, 'геометрія': 3,
        'історія_України': 2, 'всесвітня_історія': 1, 'біологія': 2, 'фізика': 2,
        'хімія': 2, 'географія': 1, 'захист_України': 1, 'фізкультура': 3,
        'інформатика': 1, 'правознавство': 1
    },
    11: {
        'українська_мова': 2, 'українська_література': 2, 'англійська': 3, 'алгебра': 4, 'геометрія': 3,
        'історія_України': 2, 'всесвітня_історія': 1, 'біологія': 1, 'фізика': 1,
        'хімія': 1, 'географія': 1, 'захист_України': 1, 'фізкультура': 3,
        'інформатика': 1, 'правознавство': 2
    }
}

teachers = {
    'математика': ['Ірина Петрівна', 'Галина Степанівна', 'Світлана Василівна'],
    'англійська': ['Марта Василівна', 'Олег Ігорович', 'Тетяна Вікторівна'],
    'українська_мова': ['Оксана Іванівна', 'Марія Михайлівна', 'Лідія Степанівна'],
    'українська_література': ['Оксана Іванівна', 'Марія Михайлівна', 'Лідія Степанівна'],
    'історія': ['Ірина Вікторівна', 'Ганна Іллівна'],
    'алгебра': ['Світлана Василівна', 'Галина Степанівна', 'Ірина Петрівна'],
    'геометрія': ['Світлана Василівна', 'Галина Степанівна', 'Ірина Петрівна'],
    'природознавство': ['Леся Віталіївна'],
    'біологія': ['Олена Степанівна'],
    'фізика': ['Інна Анатоліївна', 'Олег Олексійович', 'Марія Воломирівна'],
    'географія': ['Марина Сергіївна', 'Ігор Миколайович'],
    'інформатика': ['Тетяна Максимівна', 'Олена Юріївна'],
    'трудове_навчання': ['Андрій Петрович', 'Марина Сергіївна'],
    'мистецтво': ['Катерина Олександрівна'],
    'основи_здоров’я': ['Ірина Вікторівна'],
    'історія_України': ['Юрій Миколайович', 'Людмила Іванівна', 'Марія Ярославівна'],
    'всесвітня_історія': ['Ірина Вікторівна', 'Людмила Іванівна', 'Ганна Іллівна'],
    'правознавство': ['Олег Ігорович'],
    'захист_України': ['Петро Дмитрович'],
    'фізкультура': ['Олексій Андрійович', 'Юрій Олегович'],
    'хімія': ['Ірина Вікторівна', 'Галина Ігорівна', 'Максим Богданович']}

DAYS = ['Пн', 'Вт', 'Ср', 'Чт', 'Пт']
teacher_schedule = defaultdict(lambda: defaultdict(set))

def get_number_of_lessons(class_num):
    number_of_lessons = {}
    for day in DAYS:
        number_of_lessons[day] = sum(programme[class_num].values()) // 5
    for _ in range(sum(programme[class_num].values()) % 5):
        day = random.choice(DAYS)
        number_of_lessons[day] += 1
    return number_of_lessons


def generate_schedule_for_class(class_name):
    class_num = int(class_name[:-1])
    subjects = programme[class_num]

    subject_pool = []
    for subject, hours in subjects.items():
        subject_pool.extend([subject] * hours)

    random.shuffle(subject_pool)
    number_of_lessons = get_number_of_lessons(class_num)
    schedule = {day: [None]*number_of_lessons[day] for day in DAYS}

    for subject in subject_pool:
        placed = False
        for day in DAYS:
            for slot in range(number_of_lessons[day]):
                if schedule[day][slot] is None:
                    for teacher in random.sample(teachers[subject], len(teachers[subject])):
                        if slot not in teacher_schedule[teacher][day]:
                            schedule[day][slot] = (subject, teacher)
                            teacher_schedule[teacher][day].add(slot)
                            placed = True
                            break
                if placed:
                    break
            if placed:
                break
    return schedule


@app.route('/')
def home():
    all_schedule = {}
    teacher_schedule.clear()  # обнуляємо перед новою генерацією
    for cl in classes:
        all_schedule[cl] = generate_schedule_for_class(cl)
    return render_template('schedule.html', all_schedule=all_schedule, days=DAYS)

if __name__ == '__main__':
    app.run(debug=True)

# all_schedule = {}
# for cl in classes:
#     all_schedule[cl] = generate_schedule_for_class(cl)
# print(all_schedule)
